## Plan Result (sbox_shutter_webapp)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Replace
  * module.static_webapp.github_actions_secret.secret[&#34;plum&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.static_webapp.github_actions_secret.secret["plum"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-24 09:05:46 +0000 UTC" -> (known after apply)
      ~ id              = "azure-shutter-pages:plum" -> (known after apply)
      ~ secret_name     = "plum" -> "plum_sbox" # forces replacement
      ~ updated_at      = "2023-07-24 09:05:46 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1631,"Program":"tfcmt","SHA1":"","Target":"sbox_shutter_webapp","Vars":{}} -->